HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxCcu6_reg.h
/** \\brief  28, Dead-Time Control Register for Timer12 */
#define CCU61_T12DTC /*lint --e(923)*/ (*(volatile Ifx_CCU6_T12DTC*)0xF0002B28u)

/** \\brief  68, T12 Mode Select Register */
#define CCU61_T12MSEL /*lint --e(923)*/ (*(volatile Ifx_CCU6_T12MSEL*)0xF0002B68u)

/** \\brief  24, Timer 12 Period Register */
#define CCU61_T12PR /*lint --e(923)*/ (*(volatile Ifx_CCU6_T12PR*)0xF0002B24u)

/** \\brief  50, Timer T13 Counter Register */
#define CCU61_T13 /*lint --e(923)*/ (*(volatile Ifx_CCU6_T13*)0xF0002B50u)

/** \\brief  54, Timer 13 Period Register */
#define CCU61_T13PR /*lint --e(923)*/ (*(volatile Ifx_CCU6_T13PR*)0xF0002B54u)

/** \\brief  70, Timer Control Register 0 */
#define CCU61_TCTR0 /*lint --e(923)*/ (*(volatile Ifx_CCU6_TCTR0*)0xF0002B70u)

/** \\brief  74, Timer Control Register 2 */
#define CCU61_TCTR2 /*lint --e(923)*/ (*(volatile Ifx_CCU6_TCTR2*)0xF0002B74u)

/** \\brief  78, Timer Control Register 4 */
#define CCU61_TCTR4 /*lint --e(923)*/ (*(volatile Ifx_CCU6_TCTR4*)0xF0002B78u)

/** \\brief  84, Trap Control Register */
#define CCU61_TRPCTR /*lint --e(923)*/ (*(volatile Ifx_CCU6_TRPCTR*)0xF0002B84u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Ccu6_Cfg_Ccu62
 * \{  */

/** \\brief  FC, Access Enable Register 0 */
#define CCU62_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_CCU6_ACCEN0*)0xF0002CFCu)

/** \\brief  F8, Access Enable Register 1 */
#define CCU62_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_CCU6_ACCEN1*)0xF0002CF8u)

/** \\brief  30, Capture/Compare Register for Channel CC60 */
#define CCU62_CC60R /*lint --e(923)*/ (*(volatile Ifx_CCU6_CC60R*)0xF0002C30u)

/** \\brief  40, Capture/Compare Shadow Reg. for Channel CC60 */
#define CCU62_CC60SR /*lint --e(923)*/ (*(volatile Ifx_CCU6_CC60SR*)0xF0002C40u)

/** \\brief  34, Capture/Compare Register for Channel CC61 */
#define CCU62_CC61R /*lint --e(923)*/ (*(volatile Ifx_CCU6_CC61R*)0xF0002C34u)

/** \\brief  44, Capture/Compare Shadow Reg. for Channel CC61 */
#define CCU62_CC61SR /*lint --e(923)*/ (*(volatile Ifx_CCU6_CC61SR*)0xF0002C44u)

/** \\brief  38, Capture/Compare Register for Channel CC62 */
#define CCU62_CC62R /*lint --e(923)*/ (*(volatile Ifx_CCU6_CC62R*)0xF0002C38u)

/** \\brief  48, Capture/Compare Shadow Reg. for Channel CC62 */
#define CCU62_CC62SR /*lint --e(923)*/ (*(volatile Ifx_CCU6_CC62SR*)0xF0002C48u)

/** \\brief  58, Compare Register for T13 */
#define CCU62_CC63R /*lint --e(923)*/ (*(volatile Ifx_CCU6_CC63R*)0xF0002C58u)

/** \\brief  5C, Compare Shadow Register for T13 */
#define CCU62_CC63SR /*lint --e(923)*/ (*(volatile Ifx_CCU6_CC63SR*)0xF0002C5Cu)

/** \\brief  0, Clock Control Register */
#define CCU62_CLC /*lint --e(923)*/ (*(volatile Ifx_CCU6_CLC*)0xF0002C00u)

/** \\brief  64, Compare State Modification Register */
#define CCU62_CMPMODIF /*lint --e(923)*/ (*(volatile Ifx_CCU6_CMPMODIF*)0xF0002C64u)

/** \\brief  60, Compare State Register */
#define CCU62_CMPSTAT /*lint --e(923)*/ (*(volatile Ifx_CCU6_CMPSTAT*)0xF0002C60u)

/** \\brief  8, Module Identification Register */
#define CCU62_ID /*lint --e(923)*/ (*(volatile Ifx_CCU6_ID*)0xF0002C08u)

/** \\brief  B0, Interrupt Enable Register */
#define CCU62_IEN /*lint --e(923)*/ (*(volatile Ifx_CCU6_IEN*)0xF0002CB0u)

/** \\brief  98, Input Monitoring Register */
#define CCU62_IMON /*lint --e(923)*/ (*(volatile Ifx_CCU6_IMON*)0xF0002C98u)

/** \\brief  AC, Interrupt Node Pointer Register */
#define CCU62_INP /*lint --e(923)*/ (*(volatile Ifx_CCU6_INP*)0xF0002CACu)

/** \\brief  A0, Interrupt Status Register */
#define CCU62_IS /*lint --e(923)*/ (*(volatile Ifx_CCU6_IS*)0xF0002CA0u)

/** \\brief  A8, Interrupt Status Reset Register */
#define CCU62_ISR /*lint --e(923)*/ (*(volatile Ifx_CCU6_ISR*)0xF0002CA8u)

/** \\brief  A4, Interrupt Status Set Register */
#define CCU62_ISS /*lint --e(923)*/ (*(volatile Ifx_CCU6_ISS*)0xF0002CA4u)

/** \\brief  F4, Kernel Reset Register 0 */
#define CCU62_KRST0 /*lint --e(923)*/ (*(volatile Ifx_CCU6_KRST0*)0xF0002CF4u)

/** \\brief  F0, Kernel Reset Register 1 */
#define CCU62_KRST1 /*lint --e(923)*/ (*(volatile Ifx_CCU6_KRST1*)0xF0002CF0u)

/** \\brief  EC, Kernel Reset Status Clear Register */
#define CCU62_KRSTCLR /*lint --e(923)*/ (*(volatile Ifx_CCU6_KRSTCLR*)0xF0002CECu)

/** \\brief  1C, Kernel State Control Sensitivity Register */
#define CCU62_KSCSR /*lint --e(923)*/ (*(volatile Ifx_CCU6_KSCSR*)0xF0002C1Cu)

/** \\brief  9C, Lost Indicator Register */
#define CCU62_LI /*lint --e(923)*/ (*(volatile Ifx_CCU6_LI*)0xF0002C9Cu)

/** \\brief  4, Module Configuration Register */
#define CCU62_MCFG /*lint --e(923)*/ (*(volatile Ifx_CCU6_MCFG*)0xF0002C04u)

/** \\brief  94, Multi-Channel Mode Control Register */
#define CCU62_MCMCTR /*lint --e(923)*/ (*(volatile Ifx_CCU6_MCMCTR*)0xF0002C94u)

/** \\brief  90, Multi-Channel Mode Output Register */
#define CCU62_MCMOUT /*lint --e(923)*/ (*(volatile Ifx_CCU6_MCMOUT*)0xF0002C90u)

/** \\brief  8C, Multi-Channel Mode Output Shadow Register */
#define CCU62_MCMOUTS /*lint --e(923)*/ (*(volatile Ifx_CCU6_MCMOUTS*)0xF0002C8Cu)

/** \\brief  80, Modulation Control Register */
#define CCU62_MODCTR /*lint --e(923)*/ (*(volatile Ifx_CCU6_MODCTR*)0xF0002C80u)

/** \\brief  C, CCU60 Module Output Select Register */
#define CCU62_MOSEL /*lint --e(923)*/ (*(volatile Ifx_CCU6_MOSEL*)0xF0002C0Cu)

/** \\brief  E8, OCDS Control and Status Register */
#define CCU62_OCS /*lint --e(923)*/ (*(volatile Ifx_CCU6_OCS*)0xF0002CE8u)

/** \\brief  10, Port Input Select Register 0 */
#define CCU62_PISEL0 /*lint --e(923)*/ (*(volatile Ifx_CCU6_PISEL0*)0xF0002C10u)

/** \\brief  14, Port Input Select Register 2 */
#define CCU62_PISEL2 /*lint --e(923)*/ (*(volatile Ifx_CCU6_PISEL2*)0xF0002C14u)

/** \\brief  88, Passive State Level Register */
#define CCU62_PSLR /*lint --e(923)*/ (*(volatile Ifx_CCU6_PSLR*)0xF0002C88u)

/** \\brief  20, Timer T12 Counter Register */
#define CCU62_T12 /*lint --e(923)*/ (*(volatile Ifx_CCU6_T12*)0xF0002C20u)

