HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxCcu6_reg.h
/** \\brief  28, Dead-Time Control Register for Timer12 */
#define CCU62_T12DTC /*lint --e(923)*/ (*(volatile Ifx_CCU6_T12DTC*)0xF0002C28u)

/** \\brief  68, T12 Mode Select Register */
#define CCU62_T12MSEL /*lint --e(923)*/ (*(volatile Ifx_CCU6_T12MSEL*)0xF0002C68u)

/** \\brief  24, Timer 12 Period Register */
#define CCU62_T12PR /*lint --e(923)*/ (*(volatile Ifx_CCU6_T12PR*)0xF0002C24u)

/** \\brief  50, Timer T13 Counter Register */
#define CCU62_T13 /*lint --e(923)*/ (*(volatile Ifx_CCU6_T13*)0xF0002C50u)

/** \\brief  54, Timer 13 Period Register */
#define CCU62_T13PR /*lint --e(923)*/ (*(volatile Ifx_CCU6_T13PR*)0xF0002C54u)

/** \\brief  70, Timer Control Register 0 */
#define CCU62_TCTR0 /*lint --e(923)*/ (*(volatile Ifx_CCU6_TCTR0*)0xF0002C70u)

/** \\brief  74, Timer Control Register 2 */
#define CCU62_TCTR2 /*lint --e(923)*/ (*(volatile Ifx_CCU6_TCTR2*)0xF0002C74u)

/** \\brief  78, Timer Control Register 4 */
#define CCU62_TCTR4 /*lint --e(923)*/ (*(volatile Ifx_CCU6_TCTR4*)0xF0002C78u)

/** \\brief  84, Trap Control Register */
#define CCU62_TRPCTR /*lint --e(923)*/ (*(volatile Ifx_CCU6_TRPCTR*)0xF0002C84u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Ccu6_Cfg_Ccu63
 * \{  */

/** \\brief  FC, Access Enable Register 0 */
#define CCU63_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_CCU6_ACCEN0*)0xF0002DFCu)

/** \\brief  F8, Access Enable Register 1 */
#define CCU63_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_CCU6_ACCEN1*)0xF0002DF8u)

/** \\brief  30, Capture/Compare Register for Channel CC60 */
#define CCU63_CC60R /*lint --e(923)*/ (*(volatile Ifx_CCU6_CC60R*)0xF0002D30u)

/** \\brief  40, Capture/Compare Shadow Reg. for Channel CC60 */
#define CCU63_CC60SR /*lint --e(923)*/ (*(volatile Ifx_CCU6_CC60SR*)0xF0002D40u)

/** \\brief  34, Capture/Compare Register for Channel CC61 */
#define CCU63_CC61R /*lint --e(923)*/ (*(volatile Ifx_CCU6_CC61R*)0xF0002D34u)

/** \\brief  44, Capture/Compare Shadow Reg. for Channel CC61 */
#define CCU63_CC61SR /*lint --e(923)*/ (*(volatile Ifx_CCU6_CC61SR*)0xF0002D44u)

/** \\brief  38, Capture/Compare Register for Channel CC62 */
#define CCU63_CC62R /*lint --e(923)*/ (*(volatile Ifx_CCU6_CC62R*)0xF0002D38u)

/** \\brief  48, Capture/Compare Shadow Reg. for Channel CC62 */
#define CCU63_CC62SR /*lint --e(923)*/ (*(volatile Ifx_CCU6_CC62SR*)0xF0002D48u)

/** \\brief  58, Compare Register for T13 */
#define CCU63_CC63R /*lint --e(923)*/ (*(volatile Ifx_CCU6_CC63R*)0xF0002D58u)

/** \\brief  5C, Compare Shadow Register for T13 */
#define CCU63_CC63SR /*lint --e(923)*/ (*(volatile Ifx_CCU6_CC63SR*)0xF0002D5Cu)

/** \\brief  0, Clock Control Register */
#define CCU63_CLC /*lint --e(923)*/ (*(volatile Ifx_CCU6_CLC*)0xF0002D00u)

/** \\brief  64, Compare State Modification Register */
#define CCU63_CMPMODIF /*lint --e(923)*/ (*(volatile Ifx_CCU6_CMPMODIF*)0xF0002D64u)

/** \\brief  60, Compare State Register */
#define CCU63_CMPSTAT /*lint --e(923)*/ (*(volatile Ifx_CCU6_CMPSTAT*)0xF0002D60u)

/** \\brief  8, Module Identification Register */
#define CCU63_ID /*lint --e(923)*/ (*(volatile Ifx_CCU6_ID*)0xF0002D08u)

/** \\brief  B0, Interrupt Enable Register */
#define CCU63_IEN /*lint --e(923)*/ (*(volatile Ifx_CCU6_IEN*)0xF0002DB0u)

/** \\brief  98, Input Monitoring Register */
#define CCU63_IMON /*lint --e(923)*/ (*(volatile Ifx_CCU6_IMON*)0xF0002D98u)

/** \\brief  AC, Interrupt Node Pointer Register */
#define CCU63_INP /*lint --e(923)*/ (*(volatile Ifx_CCU6_INP*)0xF0002DACu)

/** \\brief  A0, Interrupt Status Register */
#define CCU63_IS /*lint --e(923)*/ (*(volatile Ifx_CCU6_IS*)0xF0002DA0u)

/** \\brief  A8, Interrupt Status Reset Register */
#define CCU63_ISR /*lint --e(923)*/ (*(volatile Ifx_CCU6_ISR*)0xF0002DA8u)

/** \\brief  A4, Interrupt Status Set Register */
#define CCU63_ISS /*lint --e(923)*/ (*(volatile Ifx_CCU6_ISS*)0xF0002DA4u)

/** \\brief  F4, Kernel Reset Register 0 */
#define CCU63_KRST0 /*lint --e(923)*/ (*(volatile Ifx_CCU6_KRST0*)0xF0002DF4u)

/** \\brief  F0, Kernel Reset Register 1 */
#define CCU63_KRST1 /*lint --e(923)*/ (*(volatile Ifx_CCU6_KRST1*)0xF0002DF0u)

/** \\brief  EC, Kernel Reset Status Clear Register */
#define CCU63_KRSTCLR /*lint --e(923)*/ (*(volatile Ifx_CCU6_KRSTCLR*)0xF0002DECu)

/** \\brief  1C, Kernel State Control Sensitivity Register */
#define CCU63_KSCSR /*lint --e(923)*/ (*(volatile Ifx_CCU6_KSCSR*)0xF0002D1Cu)

/** \\brief  9C, Lost Indicator Register */
#define CCU63_LI /*lint --e(923)*/ (*(volatile Ifx_CCU6_LI*)0xF0002D9Cu)

/** \\brief  4, Module Configuration Register */
#define CCU63_MCFG /*lint --e(923)*/ (*(volatile Ifx_CCU6_MCFG*)0xF0002D04u)

/** \\brief  94, Multi-Channel Mode Control Register */
#define CCU63_MCMCTR /*lint --e(923)*/ (*(volatile Ifx_CCU6_MCMCTR*)0xF0002D94u)

/** \\brief  90, Multi-Channel Mode Output Register */
#define CCU63_MCMOUT /*lint --e(923)*/ (*(volatile Ifx_CCU6_MCMOUT*)0xF0002D90u)

/** \\brief  8C, Multi-Channel Mode Output Shadow Register */
#define CCU63_MCMOUTS /*lint --e(923)*/ (*(volatile Ifx_CCU6_MCMOUTS*)0xF0002D8Cu)

/** \\brief  80, Modulation Control Register */
#define CCU63_MODCTR /*lint --e(923)*/ (*(volatile Ifx_CCU6_MODCTR*)0xF0002D80u)


/** \\brief  E8, OCDS Control and Status Register */
#define CCU63_OCS /*lint --e(923)*/ (*(volatile Ifx_CCU6_OCS*)0xF0002DE8u)

/** \\brief  10, Port Input Select Register 0 */
#define CCU63_PISEL0 /*lint --e(923)*/ (*(volatile Ifx_CCU6_PISEL0*)0xF0002D10u)

/** \\brief  14, Port Input Select Register 2 */
#define CCU63_PISEL2 /*lint --e(923)*/ (*(volatile Ifx_CCU6_PISEL2*)0xF0002D14u)

/** \\brief  88, Passive State Level Register */
#define CCU63_PSLR /*lint --e(923)*/ (*(volatile Ifx_CCU6_PSLR*)0xF0002D88u)

/** \\brief  20, Timer T12 Counter Register */
#define CCU63_T12 /*lint --e(923)*/ (*(volatile Ifx_CCU6_T12*)0xF0002D20u)

/** \\brief  28, Dead-Time Control Register for Timer12 */
#define CCU63_T12DTC /*lint --e(923)*/ (*(volatile Ifx_CCU6_T12DTC*)0xF0002D28u)

/** \\brief  68, T12 Mode Select Register */
#define CCU63_T12MSEL /*lint --e(923)*/ (*(volatile Ifx_CCU6_T12MSEL*)0xF0002D68u)

/** \\brief  24, Timer 12 Period Register */
#define CCU63_T12PR /*lint --e(923)*/ (*(volatile Ifx_CCU6_T12PR*)0xF0002D24u)

/** \\brief  50, Timer T13 Counter Register */
#define CCU63_T13 /*lint --e(923)*/ (*(volatile Ifx_CCU6_T13*)0xF0002D50u)

/** \\brief  54, Timer 13 Period Register */
#define CCU63_T13PR /*lint --e(923)*/ (*(volatile Ifx_CCU6_T13PR*)0xF0002D54u)

/** \\brief  70, Timer Control Register 0 */
#define CCU63_TCTR0 /*lint --e(923)*/ (*(volatile Ifx_CCU6_TCTR0*)0xF0002D70u)

/** \\brief  74, Timer Control Register 2 */
#define CCU63_TCTR2 /*lint --e(923)*/ (*(volatile Ifx_CCU6_TCTR2*)0xF0002D74u)

/** \\brief  78, Timer Control Register 4 */
#define CCU63_TCTR4 /*lint --e(923)*/ (*(volatile Ifx_CCU6_TCTR4*)0xF0002D78u)

/** \\brief  84, Trap Control Register */
#define CCU63_TRPCTR /*lint --e(923)*/ (*(volatile Ifx_CCU6_TRPCTR*)0xF0002D84u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXCCU6_REG_H */
